resisting.org
#+TITLE: 要定得住
#+DATE: <2022-04-14 Thu 20:45>
我今天早上列今天 GTD 的时候就告诉自己----我今天一定要把 Org-roam 的 v1 到 v2 的迁移问题解决掉！

然后今天上午我就开始想----既然本质是 plain text 的话为什么不尝试下 Obsidian 呢？给它一个机会，也给自己多一个选择。然后我就开始试用了，然后就发现了一些问题……

尝试解决过程中，我看到了 Logseq，这货不仅 plain text，甚至更加凶残地直接支持 Org 文件！简直就是 Emacs 用户的不二之选有没有！

就在我即将冲动的时候，我突然想到了既然选它就是为了 Org，那为什么不回到 Org-roam 呢？……

就这样转了一个大圈，现在是北京时间 20:45，我又看到 GTD list 里面的 Org-roam 静静地立在那里，它顶着羚羊的大脸，一言不发，笑眯眯的眼神里却轻蔑地透出两个字----诱惑，随后口里轻轻吐出----明天见……

我觉得这件事给我的教训就是----不管什么时候都不能忘了自己为什么出发，这花花世界滚滚红尘的诱惑太多了……要定得住！

在 Org-roam 这件事上，什么阿尔卑斯山上融化的积雪，蓝色的湖泊里飘荡的雾气，高山上怒放的花朵和迎风站立领口张开的姑娘……和 Emacs 没关系的都给我去一边的。

明天见！

#我得把这件事记下来不然我就忘了
